In [1]:
import pandas as pd
import numpy as np
from numpy.random import rand as rn

In [ ]:
  # usefull operations  head(),tail(),unique(),nunique(),value_counts()

In [8]:
df=pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9],
                 'col2':[11,22,33,44,22,33,44,55,66],
                 'col3':['a','bb','c','ddd','e','fff','g','h','ii']})
df

   col1  col2 col3
0     1    11    a
1     2    22   bb
2     3    33    c
3     4    44  ddd
4     5    22    e
5     6    33  fff
6     7    44    g
7     8    55    h
8     9    66   ii

In [9]:
df.head()

   col1  col2 col3
0     1    11    a
1     2    22   bb
2     3    33    c
3     4    44  ddd
4     5    22    e

In [10]:
df.tail()

   col1  col2 col3
4     5    22    e
5     6    33  fff
6     7    44    g
7     8    55    h
8     9    66   ii

In [11]:
df.col2.unique()

array([11, 22, 33, 44, 55, 66], dtype=int64)

In [12]:
df.col2.nunique()

6

In [14]:
df.col2.value_counts()

33    2
22    2
44    2
66    1
55    1
11    1
Name: col2, dtype: int64

In [15]:
    # applying method

In [21]:
def testfunc(x):
    if x>40:
     return(10*np.log10(x))
    else:
     return(x/10)
df['funcApplied']=df.col2.apply(testfunc)
df

   col1  col2 col3  FuncApplied  funcApplied
0     1    11    a     1.100000     1.100000
1     2    22   bb    13.424227     2.200000
2     3    33    c    15.185139     3.300000
3     4    44  ddd    16.434527    16.434527
4     5    22    e    13.424227     2.200000
5     6    33  fff    15.185139     3.300000
6     7    44    g    16.434527    16.434527
7     8    55    h    17.403627    17.403627
8     9    66   ii    18.195439    18.195439

In [23]:
df['col3 length']=df.col3.apply(len)
df

   col1  col2 col3  FuncApplied  funcApplied  col3 length
0     1    11    a     1.100000     1.100000            1
1     2    22   bb    13.424227     2.200000            2
2     3    33    c    15.185139     3.300000            1
3     4    44  ddd    16.434527    16.434527            3
4     5    22    e    13.424227     2.200000            1
5     6    33  fff    15.185139     3.300000            3
6     7    44    g    16.434527    16.434527            1
7     8    55    h    17.403627    17.403627            1
8     9    66   ii    18.195439    18.195439            2

In [41]:
df['funcApplied'].apply((np.sqrt))
df

   col1  col2 col3  FuncApplied  funcApplied  col3 length
0     1    11    a     1.100000     1.100000            1
1     2    22   bb    13.424227     2.200000            2
2     3    33    c    15.185139     3.300000            1
3     4    44  ddd    16.434527    16.434527            3
4     5    22    e    13.424227     2.200000            1
5     6    33  fff    15.185139     3.300000            3
6     7    44    g    16.434527    16.434527            1
7     8    55    h    17.403627    17.403627            1
8     9    66   ii    18.195439    18.195439            2

In [42]:
df=pd.DataFrame({'col1':[1,2,3,np.nan],
                'col2':[np.nan,555,666,444],
                 'col3':['a','b','c','d']})
df

   col1   col2 col3
0   1.0    NaN    a
1   2.0  555.0    b
2   3.0  666.0    c
3   NaN  444.0    d

In [56]:
df.isnull()        #isnull

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [53]:
df.fillna('fill')               #fillna()

   col1   col2 col3
0   1.0   fill    a
1   2.0  555.0    b
2   3.0  666.0    c
3  fill  444.0    d

In [ ]:
     # read and write files

In [59]:
data={
    'ind':{'country':'india','population':14000000,'gdp':12.3,'continent':'asia'}}
colums=('country','population','gdp','continent')
data

{'ind': {'country': 'india',
  'population': 14000000,
  'gdp': 12.3,
  'continent': 'asia'}}

In [61]:
df=pd.DataFrame(data=data)
df

                 ind
continent       asia
country        india
gdp             12.3
population  14000000

In [63]:
df=pd.DataFrame(data=data).transpose()
df

    continent country   gdp population
ind      asia   india  12.3   14000000

In [67]:
df.to_csv('data.csv')      #save data to file data.csv

In [77]:
data=pd.read_csv('data.csv',index_col=0)              # read data
data

    continent country   gdp  population
ind      asia   india  12.3    14000000

In [81]:
df.to_excel('data.xlsx')          # save data to file data.xlsx

In [82]:
df=pd.read_excel('data.xlsx',index_col=0)     #read data

In [83]:
df.to_json('data.json')          # save data to file data.json

In [86]:
df=pd.read_json('data.json')#read data
df

    continent country   gdp  population
ind      asia   india  12.3    14000000

In [87]:
df.to_pickle('data.pickle')          # save data to file data.xlsx

In [88]:
df=pd.read_pickle('data.pickle')   #read data
df